Repository: faraz-webdev/custom-plugins
Catalog: WooCommerce Email Translator/languages/wc-email-translator-*.po
Languages: es_es, fr_fr

source: Email Translator Settings
es_es: Configuraciones del Traductor de Correos
fr_fr: Paramètres du Traducteur de Courriels

source: Email Translator
es_es: Traductor de Correos
fr_fr: Traducteur de Courriels

source: Statistics
es_es: Estadísticas
fr_fr: Statistiques

source: Email Statistics
es_es: Estadísticas de Correos
fr_fr: Statistiques des Courriels

source: Emails Sent
es_es: Correos Enviados
fr_fr: Courriels Envoyés

source: Emails Confirmed
es_es: Correos Confirmados
fr_fr: Courriels Confirmés

source: Default email content
es_es: Contenido de correo predeterminado
fr_fr: Contenu de courriel par défaut

source: Order Confirmation
es_es: Confirmación de Pedido
fr_fr: Confirmation de Commande

source: Please confirm your order by clicking the following link:
es_es: Por favor confirme su pedido haciendo clic en el siguiente enlace:
fr_fr: Veuillez confirmer votre commande en cliquant sur le lien suivant :

source: Order confirmed by customer
es_es: Pedido confirmado por el cliente
fr_fr: Commande confirmée par le client
